       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. firstfree.
AUTHOR. Sable.
DATE-WRITTEN.December 31st 2021
ENVIRONMENT DIVISION.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 NUM1 PIC S9(5)V9(5) VALUE ZERO.
01 NUM2 PIC S9(5)V9(5) VALUE ZERO.
01 ANS PIC S9(16)V9(20) VALUE ZERO.
01 REM PIC S9(16)V9(20) VALUE ZERO.
PROCEDURE DIVISION.
DISPLAY "ENTER NUM1: " WITH NO ADVANCING.
ACCEPT NUM1.
DISPLAY "ENTER NUM1: " WITH NO ADVANCING.
ACCEPT NUM2.
ADD NUM1, NUM2 GIVING ANS.
DISPLAY "Sum " ANS.
COMPUTE ANS = NUM2 - NUM1.
DISPLAY "Difference " ANS.
MULTIPLY NUM1 BY NUM2 GIVING ANS.
DISPLAY "Multiplied " ANS.
DIVIDE NUM1 BY NUM2 GIVING ANS REMAINDER REM.
DISPLAY "Divided " ANS.
DISPLAY "Rem " REM.
COMPUTE ANS = NUM1 ** 2.
DISPLAY "NUM1 SQUARED " ANS.
COMPUTE ANS = NUM2 ** 2.
DISPLAY "NUM2 SQUARED " ANS
COMPUTE ANS ROUNDED = NUM1 * NUM2 
DISPLAY "ROUNDED MULTIPLICATION = " ANS
STOP RUN.
