000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. firstlearn.
000030 AUTHOR. Sable.
000040 DATE-WRITTEN.December 30th 2021
000050 ENVIRONMENT DIVISION.
000060 DATA DIVISION.
000070 FILE SECTION.
000080 WORKING-STORAGE SECTION.
000090 01 SAMPLE_DATA PIC X(10) VALUE "Stuff".
000100 01 SIGNED_NUM PIC S9(4) VALUE -1234.
000110 01 PAYCHECK PIC 9(8)V99 VALUE ZEROS.
000120 01 FLOAT_NUM PIC 9(2)V99.
000130 01 CUSTOMER.
000140     02 IDENT PIC 9(3).
000150     02 CustName PIC X(20).
000160     02 DateOfBirth.
000170        03 MOB PIC 9(2).
000180        03 DOB PIC 9(2).
000190        03 YOB PIC 9(4).
000200 PROCEDURE DIVISION.
000210 ACCEPT DateOfBirth.
000220 DISPLAY DOB "/" MOB "/" YOB.
000230*MOVE HIGH-VALUE TO PAYCHECK.
000240 MOVE 12.45 TO FLOAT_NUM.
000250 ADD FLOAT_NUM TO PAYCHECK GIVING PAYCHECK
000260 DISPLAY PAYCHECK
000270 STOP RUN.
